package com.orca.back.utils.constants;

public enum ErrorCode {
    E_101("101", "用户已存在"),
    E_102("102", "用户名或密码错误"),
    E_103("103", "请填写正确的身份证号"),
    E_104("104", "请填写正确的手机号"),
    E_105("105", "请填写正确的邮箱"),
    E_106("106", "请填写正确的姓名"),
    E_107("107", "请填写正确的学号/工号"),
    E_108("108", "密码格式错误"),
    E_109("109", "用户未登录"),
    E_110("110", "非法角色"),
    E_111("111", "当前用户没有权限"),

    E_201("201", "不能为空"),
    E_202("202", "请填写正确的时间"),
    E_203("203", "结束时间需要大于开始时间"),
    E_204("204", "教学楼与教室不一致"),
    E_205("205", "教室和教学楼只能包含数字和字母，并以字母开头"),
    E_206("206", "不存在的课程节次"),
    E_207("207", "教室不存在"),
    E_208("208", "教室被使用"),
    E_209("209", "上课时间被使用，不能删除"),
    E_210("210", "上课时间段存在冲突"),
    E_211("211", "重复的教室"),
    E_212("212", "教室容量超出限制"),

    E_130("130", "用户已停用"),
    E_131("131", "用户不存在"),
    E_132("132", "学院不存在"),
    E_133("133", "专业不存在"),
    E_134("134", "无效的名字"),
    E_135("135", "无效的csv文件"),
    E_136("136", "学院名不能重复"),
    E_137("137", "专业名不能重复"),

    E_301("301", "课程编号应为大写字母+数字"),
    E_302("302", "课程名称非法"),
    E_303("303", "上课时间非法"),
    E_304("304", "课程开始时间非法"),
    E_305("305", "课程结束时间非法"),
    E_306("306", "课程教室非法"),
    E_307("307", "课程教师非法"),
    E_310("310", "课程学分非法"),
    E_311("311", "课程学时非法"),
    E_312("312", "课程容量非法"),
    E_313("313", "课程描述非法"),
    E_314("314", "重复录入课程"),
    E_315("315", "课程专业与教师专业不匹配，请查看已有课程"),
    E_316("316", "请填写所有信息"),
    E_317("317", "数据异常，请重新检查"),
    E_318("318", "课程时间段冲突"),

    E_400("400", "当前选课未开放"),
    E_401("401", "非学生无法执行该操作"),
    E_402("402", "非老师无法查看"),
    E_403("403", "选课申请无效"),
    E_404("404", "专业不符"),
    E_405("405", "非当前学期课程"),
    E_406("406", "当前选课申请未开放"),
    E_407("407", "课程容量低于选课人数"),
    E_408("408", "课程容量需大于0"),
    E_410("410", "未选课无法删除"),
    E_411("411", "重复申请"),
    E_412("411", "非选课申请不能撤回"),
    E_420("420", "重复选课"),
    E_421("421", "选课人数已满"),

    E_999("999", "数据库数据有误")
    ;

    private final String code;
    private final String msg;

    ErrorCode(String code, String msg) {
        this.code = code;
        this.msg = msg;
    }

    public String getCode(){
        return code;
    }

    public String getMsg(){
        return msg;
    }
}
